# FieldDomainPointsByXYZ Class

---
Represents a set of three-dimensional point coordinates
SystemObject Autodesk.Revit.DB.AnalysisFieldDomainPoints Autodesk.Revit.DB.AnalysisFieldDomainPointsByXYZ
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class FieldDomainPointsByXYZ : FieldDomainPoints

    Public Class FieldDomainPointsByXYZ
    	Inherits FieldDomainPoints

    public ref class FieldDomainPointsByXYZ : public FieldDomainPoints

    type FieldDomainPointsByXYZ =
        class
            inherit FieldDomainPoints
        end
The FieldDomainPointsByXYZ type exposes the following members.
| Name| Description
---|---|---
| FieldDomainPointsByXYZ| Initializes a new instance of the FieldDomainPointsByXYZ class
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from FieldDomainPoints)
Top
| Name| Description
---|---|---
| Dispose| (Inherited from FieldDomainPoints)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Analysis Namespace